{
  "@odata.type": "#microsoft.graph.cloudPcProvisioningPolicy",
  "alternateResourceUrl": "String",
  "cloudPcGroupDisplayName": "String",
  "cloudPcNamingTemplate": "String",
  "description": "String",
  "displayName": "String",
  "domainJoinConfigurations": [{"@odata.type": "microsoft.graph.cloudPcDomainJoinConfiguration"}],
  "enableSingleSignOn": "Boolean",
  "gracePeriodInHours": "Int32",
  "id": "String (identifier)",
  "imageDisplayName": "String",
  "imageId": "String",
  "imageType": "String",
  "localAdminEnabled": "Boolean",
  "microsoftManagedDesktop": {"@odata.type": "microsoft.graph.microsoftManagedDesktop"},
  "provisioningType": "String",
  "windowsSetting": {"@odata.type": "microsoft.graph.cloudPcWindowsSetting"}
}