{
  "conditions":{
    "applications":{
      "includeApplications":["None"],
      "excludeApplications":[],
      "includeUserActions":[],
      "includeAuthenticationContextClassReferences":[],
      "applicationFilter":null,
      "globalSecureAccess":null
    },
    "clients":null,
    "users":{
      "includeUsers":["None"],
      "excludeUsers":[],
      "includeGroups":[],
      "excludeGroups":[],
      "includeRoles":[],
      "excludeRoles":[],
      "includeGuestsOrExternalUsers":null,
      "excludeGuestsOrExternalUsers":null
    },
    "clientApplications":{
      "includeAgentIdServicePrincipals":["7ca55e16-b9fd-4269-afe4-444ceed088fa"],
      "excludeAgentIdServicePrincipals":["7ca55e16-b9fd-4269-afe4-444ceed088fa"],
      "agentIdServicePrincipalFilter":{
        "mode":"include",
        "rule":"CustomSecurityAttribute.testset_somename -contains \"thing\" -or CustomSecurityAttribute.Engineering_Locations -notContains \"thing2\" -and CustomSecurityAttribute.Engineering_ProjectName -ne \"thing3\""
      }
    },
    "platforms":null,
    "locations":null,
    "userRiskLevels":[],
    "signInRiskLevels":[],
    "insiderRiskLevels":null,
    "signInRiskDetections":null,
    "clientAppTypes":["all"],
    "times":null,
    "devices":null,
    "servicePrincipalRiskLevels":[],
    "authenticationFlows":null
  },
  "displayName":"labtest-caau001",
  "grantControls":{
    "operator":"AND",
    "builtInControls":["block"],
    "customAuthenticationFactors":[],
    "termsOfUse":[],
    "authenticationStrength":null
  },
  "sessionControls":null,
  "state":"enabledForReportingButNotEnforced"
}