{"conditions":{"applications":{"includeApplications":["c08f52c9-8f03-4558-a0ea-9a4c878cf343","5dc48733-b5df-475c-a49b-fa307ef00853"],"excludeApplications":["AllAgentIdResources"],"includeUserActions":[],"includeAuthenticationContextClassReferences":[],"globalSecureAccess":null},"clients":null,"users":{"includeUsers":["None"],"excludeUsers":[],"includeGroups":[],"excludeGroups":[],"includeRoles":[],"excludeRoles":[],"includeGuestsOrExternalUsers":null,"excludeGuestsOrExternalUsers":null},"clientApplications":null,"platforms":null,"locations":{"includeLocations":["All"],"excludeLocations":[]},"userRiskLevels":[],"signInRiskLevels":[],"insiderRiskLevels":null,"signInRiskDetections":null,"clientAppTypes":["all"],"times":null,"devices":null,"servicePrincipalRiskLevels":[],"authenticationFlows":null},"displayName":"labtest-caau005","grantControls":{"operator":"AND","builtInControls":[],"customAuthenticationFactors":[],"termsOfUse":[],"authenticationStrength":{"id":"00000000-0000-0000-0000-000000000004"}},"sessionControls":{"applicationEnforcedRestrictions":null,"cloudAppSecurity":null,"signInFrequency":{"type":null,"value":null,"authenticationType":"primaryAndSecondaryAuthentication","frequencyInterval":"everyTime","isEnabled":true},"persistentBrowser":null,"continuousAccessEvaluation":null,"disableResilienceDefaults":null,"secureSignInSession":null,"networkAccessSecurity":null,"globalSecureAccessFilteringProfile":null},"state":"enabledForReportingButNotEnforced"}