{"conditions":{"applications":{"includeApplications":["c08f52c9-8f03-4558-a0ea-9a4c878cf343","5dc48733-b5df-475c-a49b-fa307ef00853"],"excludeApplications":[],"includeUserActions":[],"includeAuthenticationContextClassReferences":[],"globalSecureAccess":null},"clients":null,"users":{"includeUsers":["All"],"excludeUsers":["40b18b93-ae0d-45f5-98fe-6579fc792faa"],"includeGroups":[],"excludeGroups":["410a28bd-9c9f-403f-b1b2-4a0bd04e98d9","106483b3-dcad-408b-95b7-9d3b9ad9c71b"],"includeRoles":[],"excludeRoles":["5b784334-f94b-471a-a387-e7219fc49ca2","1d336d2c-4ae8-42ef-9711-b3604ce3fc2c","8424c6f0-a189-499e-bbd0-26c1753c96d4"],"includeGuestsOrExternalUsers":null,"excludeGuestsOrExternalUsers":{"guestOrExternalUserTypes":"B2bCollaborationGuest,B2bCollaborationMember,B2bDirectConnectUser","externalTenants":{"membershipKind":"all","@odata.type":"#microsoft.graph.conditionalAccessAllExternalTenants"}}},"clientApplications":null,"platforms":null,"locations":{"includeLocations":["All"],"excludeLocations":[]},"userRiskLevels":[],"signInRiskLevels":[],"insiderRiskLevels":null,"signInRiskDetections":null,"clientAppTypes":["all"],"times":null,"devices":null,"servicePrincipalRiskLevels":[],"authenticationFlows":null},"displayName":"labtest-caau004","grantControls":{"operator":"AND","builtInControls":["compliantDevice"],"customAuthenticationFactors":[],"termsOfUse":[],"authenticationStrength":null},"sessionControls":null,"state":"enabledForReportingButNotEnforced"}