{"conditions":{"applications":{"includeApplications":["All"],"excludeApplications":[],"includeUserActions":[],"includeAuthenticationContextClassReferences":[],"applicationFilter":null,"globalSecureAccess":null},"clients":null,"users":{"includeUsers":["None"],"excludeUsers":[],"includeGroups":[],"excludeGroups":[],"includeRoles":[],"excludeRoles":[],"includeGuestsOrExternalUsers":null,"excludeGuestsOrExternalUsers":null},"clientApplications":{"includeAgentIdServicePrincipals":["All"],"excludeAgentIdServicePrincipals":["7ca55e16-b9fd-4269-afe4-444ceed088fa"],"agentIdServicePrincipalFilter":null},"platforms":null,"locations":null,"userRiskLevels":[],"signInRiskLevels":[],"insiderRiskLevels":null,"signInRiskDetections":null,"clientAppTypes":["all"],"times":null,"devices":null,"servicePrincipalRiskLevels":[],"authenticationFlows":null,"agentIdRiskLevels":"high,medium"},"displayName":"labtest-caau002","grantControls":{"operator":"AND","builtInControls":["block"],"customAuthenticationFactors":[],"termsOfUse":[],"authenticationStrength":null},"sessionControls":null,"state":"enabledForReportingButNotEnforced"}