{"conditions":{"applications":{"includeApplications":["All"],"excludeApplications":[],"includeUserActions":[],"includeAuthenticationContextClassReferences":[],"applicationFilter":null,"globalSecureAccess":null},"clients":null,"users":{"includeUsers":["None"],"excludeUsers":[],"includeGroups":[],"excludeGroups":[],"includeRoles":[],"excludeRoles":[],"includeGuestsOrExternalUsers":null,"excludeGuestsOrExternalUsers":null},"clientApplications":{"includeAgentIdServicePrincipals":["All"],"excludeAgentIdServicePrincipals":[],"agentIdServicePrincipalFilter":{"mode":"exclude","rule":"CustomSecurityAttribute.testset_somename -contains \"thing\" -and CustomSecurityAttribute.Engineering_Locations -notContains \"thing2\""}},"platforms":null,"locations":null,"userRiskLevels":[],"signInRiskLevels":[],"insiderRiskLevels":null,"signInRiskDetections":null,"clientAppTypes":["all"],"times":null,"devices":null,"servicePrincipalRiskLevels":[],"authenticationFlows":null,"agentIdRiskLevels":"high"},"displayName":"labtest-caau006","grantControls":{"operator":"AND","builtInControls":["block"],"customAuthenticationFactors":[],"termsOfUse":[],"authenticationStrength":null},"sessionControls":null,"state":"enabledForReportingButNotEnforced"}