{"conditions":{"applications":{"includeApplications":["All"],"excludeApplications":[],"includeUserActions":[],"includeAuthenticationContextClassReferences":[],"applicationFilter":null,"globalSecureAccess":null},"clients":null,"users":{"includeUsers":["AllAgentIdUsers"],"excludeUsers":[],"includeGroups":[],"excludeGroups":[],"includeRoles":[],"excludeRoles":[],"includeGuestsOrExternalUsers":null,"excludeGuestsOrExternalUsers":null},"clientApplications":null,"platforms":null,"locations":null,"userRiskLevels":[],"signInRiskLevels":[],"insiderRiskLevels":null,"signInRiskDetections":null,"times":null,"devices":null,"servicePrincipalRiskLevels":[],"authenticationFlows":null},"displayName":"labtest-caau003","grantControls":{"operator":"AND","builtInControls":["block"],"customAuthenticationFactors":[],"termsOfUse":[],"authenticationStrength":null},"sessionControls":null,"state":"enabledForReportingButNotEnforced"}