{
  "@odata.type": "#microsoft.graph.windowsQualityUpdatePolicy",
  "id": "String (identifier)",
  "displayName": "String",
  "description": "String",
  "createdDateTime": "String (timestamp)",
  "lastModifiedDateTime": "String (timestamp)",
  "roleScopeTagIds": [
    "String"
  ],
  "hotpatchEnabled": true
}