{
  "metadata": {
    "platformGroups": {
      "android,iOS": {
        "platforms": [
          "android",
          "iOS"
        ],
        "count": 10
      }
    },
    "exportTimestamp": "2025-04-02T07:50:31.0953635Z",
    "totalSettingsCount": 10,
    "version": "2025-04-02"
  },
  "platformDefinitions": {
    "android,iOS": [
      {
        "oDataType": "#microsoft.graph.deviceManagementConfigurationChoiceSettingCollectionDefinition",
        "id": "device_vendor_msft_policy_config_quiettime_mutenotificationsdaily_daysoftheweek",
        "name": "DaysOfTheWeek",
        "displayName": "Days of the week",
        "keywords": [
          "Mute",
          "Notifications",
          "Outlook",
          "Daily",
          "DaysOfTheWeek",
          "Days of the week",
          "Certain Hours"
        ],
        "visibility": "settingsCatalog,template",
        "accessTypes": "get",
        "settingDefinition": {
          "rootDefinitionId": "device_vendor_msft_policy_config_quiettime_mutenotificationsdaily",
          "categoryId": "3ccd987e-bfca-4838-98ea-576de34b3ebe",
          "settingUsage": "configuration",
          "baseUri": "./Device/Vendor/MSFT/Policy/QuietTime/MuteNotificationsDaily",
          "offsetUri": "/DaysOfTheWeek",
          "version": "638784768140635351"
        },
        "applicability": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationExchangeOnlineSettingApplicability",
          "technologies": "exchangeOnline",
          "platform": "android,iOS",
          "deviceMode": "none",
          "description": null
        },
        "options": [
          {
            "displayName": "Sunday",
            "description": null,
            "value": null,
            "optionId": null
          },
          {
            "displayName": "Monday",
            "description": null,
            "value": null,
            "optionId": null
          },
          {
            "displayName": "Tuesday",
            "description": null,
            "value": null,
            "optionId": null
          },
          {
            "displayName": "Wednesday",
            "description": null,
            "value": null,
            "optionId": null
          },
          {
            "displayName": "Thursday",
            "description": null,
            "value": null,
            "optionId": null
          },
          {
            "displayName": "Friday",
            "description": null,
            "value": null,
            "optionId": null
          },
          {
            "displayName": "Saturday",
            "description": null,
            "value": null,
            "optionId": null
          }
        ],
        "occurrence": {
          "minDeviceOccurrence": 0,
          "maxDeviceOccurrence": 1
        },
        "infoUrls": []
      },
      {
        "oDataType": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
        "id": "device_vendor_msft_policy_config_quiettime_allowusertochangesetting",
        "name": "AllowUserToChangeSetting",
        "displayName": "Allow user to change setting",
        "description": "Disallowing end users from changing this setting will prevent them from editing their global quiet time settings. Note: If Non-working time policy is applied to the user, they will be prevented from editing their global quiet time settings by default.",
        "keywords": [
          "allow",
          "user",
          "allowuser",
          "change setting",
          "End User Overrides"
        ],
        "helpText": "",
        "visibility": "template",
        "accessTypes": "get",
        "settingDefinition": {
          "rootDefinitionId": "device_vendor_msft_policy_config_quiettime_allowusertochangesetting",
          "categoryId": "a876b9c1-f22c-48aa-9826-e112f4fbe6d8",
          "settingUsage": "configuration",
          "baseUri": "./Device/Vendor/MSFT/Policy/QuietTime",
          "offsetUri": "/AllowUserToChangeSetting",
          "version": "638784768140635351",
          "defaultOptionId": "device_vendor_msft_policy_config_quiettime_allowusertochangesetting_1"
        },
        "applicability": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationExchangeOnlineSettingApplicability",
          "technologies": "exchangeOnline",
          "platform": "android,iOS",
          "deviceMode": "none",
          "description": null
        },
        "options": [
          {
            "displayName": "No",
            "description": null,
            "value": null,
            "optionId": null
          },
          {
            "displayName": "Yes",
            "description": null,
            "value": null,
            "optionId": null
          }
        ],
        "occurrence": {
          "minDeviceOccurrence": 0,
          "maxDeviceOccurrence": 1
        },
        "infoUrls": []
      },
      {
        "oDataType": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
        "id": "device_vendor_msft_policy_config_quiettime_rangesettings_endtime",
        "name": "EndTimeDateTime",
        "displayName": "End",
        "keywords": [
          "end time",
          "endtime",
          "Range Settings"
        ],
        "visibility": "template",
        "accessTypes": "get",
        "settingDefinition": {
          "rootDefinitionId": "device_vendor_msft_policy_config_quiettime_rangesettings_endtime",
          "categoryId": "39d1a447-308a-4a49-9716-3097b321da31",
          "settingUsage": "configuration",
          "baseUri": "./Device/Vendor/MSFT/Policy/QuietTime/RangeSettings",
          "offsetUri": "/EndTime",
          "version": "638784768140635351"
        },
        "applicability": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationExchangeOnlineSettingApplicability",
          "technologies": "exchangeOnline",
          "platform": "android,iOS",
          "deviceMode": "none",
          "description": null
        },
        "defaultValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": null
        },
        "valueDefinition": {
          "format": "dateTime",
          "fileTypes": [],
          "minimumLength": 0,
          "inputValidationSchema": null,
          "maximumLength": 1024,
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
          "isSecret": false
        },
        "occurrence": {
          "minDeviceOccurrence": 0,
          "maxDeviceOccurrence": 1
        },
        "dependentOn": [],
        "dependedOnBy": [],
        "infoUrls": []
      },
      {
        "oDataType": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
        "id": "device_vendor_msft_policy_config_quiettime_mutenotificationsdaily",
        "name": "MuteNotificationsDaily",
        "displayName": "Mute notifications daily",
        "keywords": [
          "Mute",
          "Notifications",
          "Teams",
          "Outlook",
          "Daily",
          "Certain Hours"
        ],
        "visibility": "template",
        "accessTypes": "get",
        "settingDefinition": {
          "rootDefinitionId": "device_vendor_msft_policy_config_quiettime_mutenotificationsdaily",
          "categoryId": "3ccd987e-bfca-4838-98ea-576de34b3ebe",
          "settingUsage": "configuration",
          "baseUri": "./Device/Vendor/MSFT/Policy/QuietTime",
          "offsetUri": "/MuteNotificationsDaily",
          "version": "638784768140635351"
        },
        "applicability": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationExchangeOnlineSettingApplicability",
          "technologies": "exchangeOnline",
          "platform": "android,iOS",
          "deviceMode": "none",
          "description": null
        },
        "options": {
          "displayName": "Require",
          "description": null,
          "value": null,
          "optionId": null
        },
        "occurrence": {
          "minDeviceOccurrence": 0,
          "maxDeviceOccurrence": 1
        },
        "infoUrls": []
      },
      {
        "oDataType": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
        "id": "device_vendor_msft_policy_config_quiettime_mutenotificationsdaily_starttime",
        "name": "StartTimeDateTime",
        "displayName": "Start time",
        "keywords": [
          "start time",
          "starttime",
          "Certain Hours"
        ],
        "visibility": "template",
        "accessTypes": "get",
        "settingDefinition": {
          "rootDefinitionId": "device_vendor_msft_policy_config_quiettime_mutenotificationsdaily",
          "categoryId": "3ccd987e-bfca-4838-98ea-576de34b3ebe",
          "settingUsage": "configuration",
          "baseUri": "./Device/Vendor/MSFT/Policy/QuietTime/MuteNotificationsDaily",
          "offsetUri": "/StartTime",
          "version": "638784768140635351"
        },
        "applicability": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationExchangeOnlineSettingApplicability",
          "technologies": "exchangeOnline",
          "platform": "android,iOS",
          "deviceMode": "none",
          "description": null
        },
        "defaultValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "18:00:00"
        },
        "valueDefinition": {
          "format": "time",
          "fileTypes": [],
          "minimumLength": 0,
          "inputValidationSchema": null,
          "maximumLength": 1024,
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
          "isSecret": false
        },
        "occurrence": {
          "minDeviceOccurrence": 0,
          "maxDeviceOccurrence": 1
        },
        "dependentOn": [
          {
            "parentSettingId": "device_vendor_msft_policy_config_quiettime_mutenotificationsdaily",
            "dependentOn": "device_vendor_msft_policy_config_quiettime_mutenotificationsdaily_1"
          }
        ],
        "dependedOnBy": [],
        "infoUrls": []
      },
      {
        "oDataType": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
        "id": "device_vendor_msft_policy_config_quiettime_mutenotificationsclockedout",
        "name": "MuteNotificationsClockedout",
        "displayName": "Mute notifications",
        "description": "This will automatically mute Microsoft Teams notifications when managed account is in non-working time. Note: Configuring this setting will prevent end users from editing their global quiet time settings.",
        "keywords": [
          "Mute",
          "Notifications",
          "Teams",
          "Outlook",
          "Non-working time"
        ],
        "visibility": "template",
        "accessTypes": "get",
        "settingDefinition": {
          "rootDefinitionId": "device_vendor_msft_policy_config_quiettime_mutenotificationsclockedout",
          "categoryId": "fde9be9c-e0ab-4dd8-9df3-0794e608d15a",
          "settingUsage": "configuration",
          "baseUri": "./Device/Vendor/MSFT/Policy/QuietTime",
          "offsetUri": "/MuteNotificationsClockedout",
          "version": "638784768140635351"
        },
        "applicability": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationExchangeOnlineSettingApplicability",
          "technologies": "exchangeOnline",
          "platform": "android,iOS",
          "deviceMode": "none",
          "description": null
        },
        "options": {
          "displayName": "Require",
          "description": null,
          "value": null,
          "optionId": null
        },
        "occurrence": {
          "minDeviceOccurrence": 0,
          "maxDeviceOccurrence": 1
        },
        "infoUrls": []
      },
      {
        "oDataType": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
        "id": "device_vendor_msft_policy_config_quiettime_rangesettings_starttime",
        "name": "StartTimeDateTime",
        "displayName": "Start",
        "keywords": [
          "start time",
          "starttime",
          "Range Settings"
        ],
        "visibility": "template",
        "accessTypes": "get",
        "settingDefinition": {
          "rootDefinitionId": "device_vendor_msft_policy_config_quiettime_rangesettings_starttime",
          "categoryId": "39d1a447-308a-4a49-9716-3097b321da31",
          "settingUsage": "configuration",
          "baseUri": "./Device/Vendor/MSFT/Policy/QuietTime/RangeSettings",
          "offsetUri": "/StartTime",
          "version": "638784768140635351"
        },
        "applicability": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationExchangeOnlineSettingApplicability",
          "technologies": "exchangeOnline",
          "platform": "android,iOS",
          "deviceMode": "none",
          "description": null
        },
        "defaultValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": null
        },
        "valueDefinition": {
          "format": "dateTime",
          "fileTypes": [],
          "minimumLength": 0,
          "inputValidationSchema": null,
          "maximumLength": 1024,
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
          "isSecret": false
        },
        "occurrence": {
          "minDeviceOccurrence": 0,
          "maxDeviceOccurrence": 1
        },
        "dependentOn": [],
        "dependedOnBy": [],
        "infoUrls": []
      },
      {
        "oDataType": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
        "id": "device_vendor_msft_policy_config_quiettime_mutenotificationsallday",
        "name": "MuteNotificationsAllday",
        "displayName": "Mute notifications all day",
        "keywords": [
          "Mute",
          "Notifications",
          "Teams",
          "Outlook",
          "Allday"
        ],
        "visibility": "template",
        "accessTypes": "get",
        "settingDefinition": {
          "rootDefinitionId": "device_vendor_msft_policy_config_quiettime_mutenotificationsallday",
          "categoryId": "ad1ecbf4-75da-4dc1-9354-7d00c0e2af72",
          "settingUsage": "configuration",
          "baseUri": "./Device/Vendor/MSFT/Policy/QuietTime",
          "offsetUri": "/MuteNotificationsAllday",
          "version": "638784768140635351"
        },
        "applicability": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationExchangeOnlineSettingApplicability",
          "technologies": "exchangeOnline",
          "platform": "android,iOS",
          "deviceMode": "none",
          "description": null
        },
        "options": {
          "displayName": "Require",
          "description": null,
          "value": null,
          "optionId": null
        },
        "occurrence": {
          "minDeviceOccurrence": 0,
          "maxDeviceOccurrence": 1
        },
        "infoUrls": []
      },
      {
        "oDataType": "#microsoft.graph.deviceManagementConfigurationChoiceSettingCollectionDefinition",
        "id": "device_vendor_msft_policy_config_quiettime_mutenotificationsallday_daysoftheweek",
        "name": "DaysOfTheWeek",
        "displayName": "Days of the week",
        "keywords": [
          "Mute",
          "Notifications",
          "Outlook",
          "Allday",
          "All day",
          "DaysOfTheWeek",
          "Days of the week"
        ],
        "visibility": "settingsCatalog,template",
        "accessTypes": "get",
        "settingDefinition": {
          "rootDefinitionId": "device_vendor_msft_policy_config_quiettime_mutenotificationsallday",
          "categoryId": "ad1ecbf4-75da-4dc1-9354-7d00c0e2af72",
          "settingUsage": "configuration",
          "baseUri": "./Device/Vendor/MSFT/Policy/QuietTime/MuteNotificationsAllday",
          "offsetUri": "/DaysOfTheWeek",
          "version": "638784768140635351"
        },
        "applicability": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationExchangeOnlineSettingApplicability",
          "technologies": "exchangeOnline",
          "platform": "android,iOS",
          "deviceMode": "none",
          "description": null
        },
        "options": [
          {
            "displayName": "Sunday",
            "description": null,
            "value": null,
            "optionId": null
          },
          {
            "displayName": "Monday",
            "description": null,
            "value": null,
            "optionId": null
          },
          {
            "displayName": "Tuesday",
            "description": null,
            "value": null,
            "optionId": null
          },
          {
            "displayName": "Wednesday",
            "description": null,
            "value": null,
            "optionId": null
          },
          {
            "displayName": "Thursday",
            "description": null,
            "value": null,
            "optionId": null
          },
          {
            "displayName": "Friday",
            "description": null,
            "value": null,
            "optionId": null
          },
          {
            "displayName": "Saturday",
            "description": null,
            "value": null,
            "optionId": null
          }
        ],
        "occurrence": {
          "minDeviceOccurrence": 0,
          "maxDeviceOccurrence": 1
        },
        "infoUrls": []
      },
      {
        "oDataType": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
        "id": "device_vendor_msft_policy_config_quiettime_mutenotificationsdaily_endtime",
        "name": "EndTime",
        "displayName": "End time",
        "keywords": [
          "end time",
          "endtime",
          "Certain Hours"
        ],
        "visibility": "template",
        "accessTypes": "get",
        "settingDefinition": {
          "rootDefinitionId": "device_vendor_msft_policy_config_quiettime_mutenotificationsdaily",
          "categoryId": "3ccd987e-bfca-4838-98ea-576de34b3ebe",
          "settingUsage": "configuration",
          "baseUri": "./Device/Vendor/MSFT/Policy/QuietTime/MuteNotificationsDaily",
          "offsetUri": "/EndTime",
          "version": "638784768140635351"
        },
        "applicability": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationExchangeOnlineSettingApplicability",
          "technologies": "exchangeOnline",
          "platform": "android,iOS",
          "deviceMode": "none",
          "description": null
        },
        "defaultValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": "07:00:00"
        },
        "valueDefinition": {
          "format": "time",
          "fileTypes": [],
          "minimumLength": 0,
          "inputValidationSchema": null,
          "maximumLength": 1024,
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
          "isSecret": false
        },
        "occurrence": {
          "minDeviceOccurrence": 0,
          "maxDeviceOccurrence": 1
        },
        "dependentOn": [
          {
            "parentSettingId": "device_vendor_msft_policy_config_quiettime_mutenotificationsdaily",
            "dependentOn": "device_vendor_msft_policy_config_quiettime_mutenotificationsdaily_1"
          }
        ],
        "dependedOnBy": [],
        "infoUrls": []
      }
    ]
  }
}
