{
  "metadata": {
    "platformGroups": {
      " visionOS,iOS": {
        "platforms": [
          "iOS",
          " visionOS"
        ],
        "count": 5
      }
    },
    "exportTimestamp": "2025-04-02T07:50:31.0953635Z",
    "totalSettingsCount": 5,
    "version": "2025-04-02"
  },
  "platformDefinitions": {
    " visionOS,iOS": [
      {
        "oDataType": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
        "id": "ade_appledevicenametemplate",
        "name": "DeivceNameTemplate",
        "displayName": "Device name template",
        "description": "Create a unique name for your devices. Names must be 63 characters or less, and can contain letters (a-z, A-Z), numbers (0-9), and hyphens.Variables supported: {{SERIAL}}, {{DEVICETYPE}}",
        "keywords": [
          "ADE profile",
          "enrollment",
          "Management settings"
        ],
        "helpText": "{{DEVICETYPE}}-{{SERIAL}}",
        "visibility": "template",
        "accessTypes": "add,delete,get,replace",
        "settingDefinition": {
          "rootDefinitionId": "ade_devicenametemplatechoices",
          "categoryId": "75e27534-3163-45b1-b34e-ca79b077b286",
          "settingUsage": "configuration",
          "baseUri": "./enrollment/ade",
          "offsetUri": "/deviceNameTemplate",
          "version": "638784768140635351"
        },
        "applicability": {
          "technologies": "enrollment",
          "platform": "iOS, visionOS",
          "deviceMode": "none",
          "description": null
        },
        "defaultValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": null
        },
        "valueDefinition": {
          "format": "regEx",
          "fileTypes": [],
          "minimumLength": 0,
          "inputValidationSchema": "^[a-zA-Z0-9-._{}]*$",
          "maximumLength": 63,
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
          "isSecret": false
        },
        "dependentOn": [
          {
            "parentSettingId": "ade_devicenametemplatechoices",
            "dependentOn": "ade_devicenametemplatechoices_1"
          }
        ],
        "dependedOnBy": [],
        "infoUrls": []
      },
      {
        "oDataType": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
        "id": "ade_lockedenrollment",
        "name": "LockedEnrollment",
        "displayName": "Locked enrollment",
        "description": "Blocks the user from removing the management profile through the iOS/iPadOS Settings menu.",
        "keywords": [
          "ADE profile",
          "enrollment",
          "Management settings"
        ],
        "helpText": "",
        "visibility": "template",
        "accessTypes": "add,delete,get,replace",
        "settingDefinition": {
          "rootDefinitionId": "ade_lockedenrollment",
          "categoryId": "75e27534-3163-45b1-b34e-ca79b077b286",
          "settingUsage": "configuration",
          "baseUri": "./enrollment/ade",
          "offsetUri": "/lockedEnrollment",
          "version": "638784768140635351",
          "defaultOptionId": "ade_lockedenrollment_1"
        },
        "applicability": {
          "technologies": "enrollment",
          "platform": "iOS, visionOS",
          "deviceMode": "none",
          "description": null
        },
        "options": [
          {
            "displayName": "No",
            "description": null,
            "value": null,
            "optionId": null
          },
          {
            "displayName": "Yes",
            "description": null,
            "value": null,
            "optionId": null
          }
        ],
        "infoUrls": []
      },
      {
        "oDataType": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
        "id": "ade_setupassistant_departmentphone",
        "name": "DepartmentPhone",
        "displayName": "Department phone",
        "keywords": [
          "ADE profile",
          "enrollment",
          "Setup Assistant"
        ],
        "helpText": "Appears to users on About Configuration screen",
        "visibility": "template",
        "accessTypes": "add,delete,get,replace",
        "settingDefinition": {
          "rootDefinitionId": "ade_setupassistant_departmentphone",
          "categoryId": "0d23daec-d948-4eee-8ee5-89ab1c59e440",
          "settingUsage": "configuration",
          "baseUri": "./enrollment/ade",
          "offsetUri": "/setupAssistant/departmentPhone",
          "version": "638784768140635351"
        },
        "applicability": {
          "technologies": "enrollment",
          "platform": "iOS, visionOS",
          "deviceMode": "none",
          "description": null
        },
        "defaultValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": null
        },
        "valueDefinition": {
          "format": "none",
          "fileTypes": [],
          "minimumLength": 0,
          "inputValidationSchema": null,
          "maximumLength": 50,
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
          "isSecret": false
        },
        "dependentOn": [],
        "dependedOnBy": [],
        "infoUrls": []
      },
      {
        "oDataType": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
        "id": "ade_devicenametemplatechoices",
        "name": "AppleDeivceNameTemplateChoices",
        "displayName": "Apple device name template",
        "description": "You can create a standard naming format to make it easier to name devices as they enroll in Intune. By default, Apple uses the device type (such as iPad or iPhone) and serial number to name ADE devices.",
        "keywords": [
          "ADE profile",
          "enrollment",
          "Management settings"
        ],
        "helpText": "",
        "visibility": "template",
        "accessTypes": "add,delete,get,replace",
        "settingDefinition": {
          "rootDefinitionId": "ade_devicenametemplatechoices",
          "categoryId": "75e27534-3163-45b1-b34e-ca79b077b286",
          "settingUsage": "configuration",
          "baseUri": "./enrollment/ade",
          "offsetUri": "/deviceNameTemplateChoices",
          "version": "638784768140635351",
          "defaultOptionId": "ade_devicenametemplatechoices_0"
        },
        "applicability": {
          "technologies": "enrollment",
          "platform": "iOS, visionOS",
          "deviceMode": "none",
          "description": null
        },
        "options": [
          {
            "displayName": "No",
            "description": null,
            "value": null,
            "optionId": null
          },
          {
            "displayName": "Yes",
            "description": null,
            "value": null,
            "optionId": null
          }
        ],
        "infoUrls": []
      },
      {
        "oDataType": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
        "id": "ade_setupassistant_department",
        "name": "Department",
        "displayName": "Department",
        "keywords": [
          "ADE profile",
          "enrollment",
          "Setup Assistant"
        ],
        "helpText": "Appears to users on About Configuration screen",
        "visibility": "template",
        "accessTypes": "add,delete,get,replace",
        "settingDefinition": {
          "rootDefinitionId": "ade_setupassistant_department",
          "categoryId": "0d23daec-d948-4eee-8ee5-89ab1c59e440",
          "settingUsage": "configuration",
          "baseUri": "./enrollment/ade",
          "offsetUri": "/setupAssistant/department",
          "version": "638784768140635351"
        },
        "applicability": {
          "technologies": "enrollment",
          "platform": "iOS, visionOS",
          "deviceMode": "none",
          "description": null
        },
        "defaultValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
          "settingValueTemplateReference": null,
          "value": null
        },
        "valueDefinition": {
          "format": "none",
          "fileTypes": [],
          "minimumLength": 0,
          "inputValidationSchema": null,
          "maximumLength": 125,
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
          "isSecret": false
        },
        "dependentOn": [],
        "dependedOnBy": [],
        "infoUrls": []
      }
    ]
  }
}
