{
  "settingCount": 1,
  "@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity",
  "name": "test",
  "createdDateTime": "2024-11-12T10:04:59.8611355Z",
  "templateReference": {
    "templateDisplayVersion": null,
    "templateFamily": "none",
    "templateId": "",
    "templateDisplayName": null
  },
  "priorityMetaData": null,
  "roleScopeTagIds": [
    "0"
  ],
  "technologies": "mdm,appleRemoteManagement",
  "description": "",
  "id": "93612eeb-a307-403c-af5e-cdc36be0d27f",
  "platforms": "macOS",
  "lastModifiedDateTime": "2024-11-12T15:04:13.587351Z",
  "creationSource": null,
  "settingsDetails": [           // HCL: "settings_details" (schema.ListNestedAttribute) in Schema()
    {
      "settingInstance": {     // HCL: "setting_instance" (schema.SingleNestedAttribute) in settingInstance()
        "settingDefinitionId": "diskmanagement_diskmanagement",    // HCL: "setting_definition_id" (schema.StringAttribute) in settingInstanceValueType()
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",  // HCL: "odata_type" (schema.StringAttribute) in settingInstanceValueType()
        "groupSettingCollectionValue": [    // HCL: "group_setting_collection_value" (schema.ListNestedAttribute) in settingInstanceValueType()
        {
          "children": [                   // HCL: "children" (schema.ListNestedAttribute) in GetGroupSettingCollectionSchema()
            {
              "settingDefinitionId": "diskmanagement_restrictions",         // HCL: "setting_definition_id" (schema.StringAttribute)
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",  // HCL: "odata_type" (schema.StringAttribute)
              "groupSettingCollectionValue": [    // HCL: "group_setting_collection_value" (schema.ListNestedAttribute)
                {
                  "children": [           // HCL: "children" (schema.ListNestedAttribute) in nested GroupSettingCollectionSchema
                    {
                      "settingDefinitionId": "diskmanagement_restrictions_externalstorage",  // HCL: "setting_definition_id" (schema.StringAttribute)
                      "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",  // HCL: "odata_type" (schema.StringAttribute)
                      "choiceSettingValue": {     // HCL: "choice_setting_value" (schema.SingleNestedAttribute)
                        "value": "diskmanagement_restrictions_externalstorage_0",  // Note: This field would be defined in GetChoiceSchema()
                        "children": []            // Note: This field would be defined in GetChoiceSchema()
                      }
                    },
                    {                     // Additional instance with same schema structure
                      "settingDefinitionId": "diskmanagement_restrictions_networkstorage",  // HCL: "setting_definition_id" (schema.StringAttribute)
                      "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",  // HCL: "odata_type" (schema.StringAttribute)
                      "choiceSettingValue": {     // HCL: "choice_setting_value" (schema.SingleNestedAttribute)
                        "value": "diskmanagement_restrictions_networkstorage_1",  // Note: This field would be defined in GetChoiceSchema()
                        "children": []            // Note: This field would be defined in GetChoiceSchema()
                      }
                    }
                  ]
                }
              ]
            }
          ]
        }
        ]
      },
      "id": "0"
    }
  ]
}
