{
  "baseResource": {
    "createdDateTime": "2025-01-16T14:07:54.5433192Z",
    "lastModifiedDateTime": "2025-01-16T14:22:48.5907542Z",
    "id": "bcf09e49-e36b-4995-b913-d460224b9129",
    "technologies": "microsoftSense",
    "platforms": "linux",
    "priorityMetaData": null,
    "roleScopeTagIds": [
      "0"
    ],
    "creationSource": null,
    "@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity",
    "settingCount": 1,
    "description": "terraform test for settings catalog templates",
    "name": "Linux - Endpoint Detection and Response",
    "templateReference": {
      "templateDisplayName": "Endpoint detection and response",
      "templateId": "3514388a-d4d1-4aa8-bd64-c317776008f5_1",
      "templateFamily": "endpointSecurityEndpointDetectionAndResponse",
      "templateDisplayVersion": "Version 1"
    }
  },
  "assignments": [
    {
      "target": {
        "groupId": "51a96cdd-4b9b-4849-b416-8c94a6d88797",
        "deviceAndAppManagementAssignmentFilterType": "none",
        "deviceAndAppManagementAssignmentFilterId": null,
        "@odata.type": "#microsoft.graph.groupAssignmentTarget"
      },
      "source": "direct",
      "sourceId": "bcf09e49-e36b-4995-b913-d460224b9129",
      "id": "bcf09e49-e36b-4995-b913-d460224b9129_51a96cdd-4b9b-4849-b416-8c94a6d88797"
    },
    {
      "target": {
        "groupId": "b15228f4-9d49-41ed-9b4f-0e7c721fd9c2",
        "deviceAndAppManagementAssignmentFilterType": "none",
        "deviceAndAppManagementAssignmentFilterId": null,
        "@odata.type": "#microsoft.graph.groupAssignmentTarget"
      },
      "source": "direct",
      "sourceId": "bcf09e49-e36b-4995-b913-d460224b9129",
      "id": "bcf09e49-e36b-4995-b913-d460224b9129_b15228f4-9d49-41ed-9b4f-0e7c721fd9c2"
    },
    {
      "target": {
        "groupId": "b8c661c2-fa9a-4351-af86-adc1729c343f",
        "deviceAndAppManagementAssignmentFilterType": "none",
        "deviceAndAppManagementAssignmentFilterId": null,
        "@odata.type": "#microsoft.graph.exclusionGroupAssignmentTarget"
      },
      "source": "direct",
      "sourceId": "bcf09e49-e36b-4995-b913-d460224b9129",
      "id": "bcf09e49-e36b-4995-b913-d460224b9129_b8c661c2-fa9a-4351-af86-adc1729c343f"
    },
    {
      "target": {
        "groupId": "f6ebd6ff-501e-4b3d-a00b-a2e102c3fa0f",
        "deviceAndAppManagementAssignmentFilterType": "none",
        "deviceAndAppManagementAssignmentFilterId": null,
        "@odata.type": "#microsoft.graph.exclusionGroupAssignmentTarget"
      },
      "source": "direct",
      "sourceId": "bcf09e49-e36b-4995-b913-d460224b9129",
      "id": "bcf09e49-e36b-4995-b913-d460224b9129_f6ebd6ff-501e-4b3d-a00b-a2e102c3fa0f"
    }
  ],
  "settings": [
    {
      "settingInstance": {
        "settingDefinitionId": "linux_mdatp_managed_edr_tags",
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "d0eb0a92-3807-4d9d-8432-6edd1aa108ce"
        },
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
        "groupSettingCollectionValue": [
          {
            "settingValueTemplateReference": null,
            "children": [
              {
                "settingDefinitionId": "linux_mdatp_managed_edr_tags_item_value",
                "simpleSettingValue": {
                  "value": "tag-value",
                  "settingValueTemplateReference": null,
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue"
                },
                "settingInstanceTemplateReference": null,
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance"
              },
              {
                "settingDefinitionId": "linux_mdatp_managed_edr_tags_item_key",
                "choiceSettingValue": {
                  "value": "linux_mdatp_managed_edr_tags_item_key_0",
                  "settingValueTemplateReference": null,
                  "children": []
                },
                "settingInstanceTemplateReference": null,
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
              }
            ]
          }
        ]
      },
      "id": "0"
    }
  ],
  "settingTemplates": {
    "settingInstanceTemplate": {
      "allowUnmanagedValues": true,
      "settingInstanceTemplateId": "d0eb0a92-3807-4d9d-8432-6edd1aa108ce",
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstanceTemplate",
      "groupSettingCollectionValueTemplate": [
        {
          "settingValueTemplateId": "5c747340-be04-4be0-85e5-1b5c22597cf5",
          "children": [
            {
              "settingDefinitionId": "linux_mdatp_managed_edr_tags_item_key",
              "settingInstanceTemplateId": "1a07a95c-9e59-4e6d-b2dc-704566275ffc",
              "isRequired": false,
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstanceTemplate",
              "choiceSettingValueTemplate": {
                "settingValueTemplateId": "c8c0155a-7851-4cf6-931d-cb3ae94dabad",
                "requiredValueDefinition": null,
                "recommendedValueDefinition": null,
                "defaultValue": {
                  "settingDefinitionOptionId": "linux_mdatp_managed_edr_tags_item_key_0",
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValueConstantDefaultTemplate",
                  "children": []
                }
              }
            },
            {
              "settingDefinitionId": "linux_mdatp_managed_edr_tags_item_value",
              "settingInstanceTemplateId": "27b00f90-03f1-42b5-84e7-1f3cf00b66e5",
              "isRequired": false,
              "simpleSettingValueTemplate": {
                "settingValueTemplateId": "e0d5a815-438c-4c68-aea1-81aa67fdd483",
                "defaultValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueConstantDefaultTemplate",
                  "constantValue": ""
                },
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueTemplate"
              },
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstanceTemplate"
            }
          ]
        }
      ],
      "settingDefinitionId": "linux_mdatp_managed_edr_tags",
      "isRequired": false
    },
    "id": "1"
  }
}
