{
  "createdDateTime": "2025-01-08T12:19:40.4759476Z",
  "templateReference": {
    "templateDisplayVersion": "Version 1",
    "templateFamily": "endpointSecurityEndpointPrivilegeManagement",
    "templateDisplayName": "Elevation rules policy",
    "templateId": "cff02aad-51b1-498d-83ad-81161a393f56_1"
  },
  "priorityMetaData": null,
  "creationSource": null,
  "description": "",
  "settingCount": 1,
  "technologies": "endpointPrivilegeManagement",
  "lastModifiedDateTime": "2025-01-08T12:45:48.0417547Z",
  "id": "8621ac40-1ded-4c5b-8910-4f4dc9c1fae5",
  "@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity",
  "platforms": "windows10",
  "roleScopeTagIds": [
    "0"
  ],
  "name": "eval-rules-policy",
  "settings": [
    {
      "id": "0",
      "settingInstance": {
        "groupSettingCollectionValue": [
          {
            "settingValueTemplateReference": null,
            "children": [
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "choiceSettingValue": {
                  "settingValueTemplateReference": {
                    "settingValueTemplateId": "2ec26569-c08f-434c-af3d-a50ac4a1ce26",
                    "useTemplateDefault": false
                  },
                  "value": "device_vendor_msft_policy_privilegemanagement_elevationrules_{elevationrulename}_allusers",
                  "children": []
                },
                "settingInstanceTemplateReference": {
                  "settingInstanceTemplateId": "0cde1c42-c701-44b1-94b7-438dd4536128"
                },
                "settingDefinitionId": "device_vendor_msft_policy_privilegemanagement_elevationrules_{elevationrulename}_appliesto"
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                "simpleSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                  "settingValueTemplateReference": {
                    "settingValueTemplateId": "9d5c2849-fa98-437c-92f6-abee4e9b8a0c",
                    "useTemplateDefault": false
                  },
                  "value": "1.0.0.0"
                },
                "settingInstanceTemplateReference": {
                  "settingInstanceTemplateId": "4a36432a-ad41-4ea6-b69f-05655afc43d2"
                },
                "settingDefinitionId": "device_vendor_msft_policy_privilegemanagement_elevationrules_{elevationrulename}_fileversion"
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                "simpleSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                  "settingValueTemplateReference": {
                    "settingValueTemplateId": "ec295dd4-6bbc-4fa8-a503-960784c53f41",
                    "useTemplateDefault": false
                  },
                  "value": "test"
                },
                "settingInstanceTemplateReference": {
                  "settingInstanceTemplateId": "08511f12-25b5-4218-812c-39a2db444ef1"
                },
                "settingDefinitionId": "device_vendor_msft_policy_privilegemanagement_elevationrules_{elevationrulename}_internalname"
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                "simpleSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                  "settingValueTemplateReference": {
                    "settingValueTemplateId": "1adcc6f7-9fa4-4ce3-8941-2ce22cf5e404",
                    "useTemplateDefault": false
                  },
                  "value": "d5774b403ae04414c6c8e8eb2bc98fc55b1677684f8cee8a4b1c509e55e3d5c1"
                },
                "settingInstanceTemplateReference": {
                  "settingInstanceTemplateId": "e4436e2c-1584-4fba-8e38-78737cbbbfdf"
                },
                "settingDefinitionId": "device_vendor_msft_policy_privilegemanagement_elevationrules_{elevationrulename}_filehash"
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                "simpleSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                  "settingValueTemplateReference": {
                    "settingValueTemplateId": "df3081ea-4ea7-4f34-ac87-49b2e84d4c4b",
                    "useTemplateDefault": false
                  },
                  "value": "2.0.0.0"
                },
                "settingInstanceTemplateReference": {
                  "settingInstanceTemplateId": "5e10c5a9-d3ca-4684-b425-e52238cf3c8b"
                },
                "settingDefinitionId": "device_vendor_msft_policy_privilegemanagement_elevationrules_{elevationrulename}_filedescription"
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "choiceSettingValue": {
                  "settingValueTemplateReference": {
                    "settingValueTemplateId": "cb2ea689-ebc3-42ea-a7a4-c704bb13e3ad",
                    "useTemplateDefault": false
                  },
                  "value": "device_vendor_msft_policy_privilegemanagement_elevationrules_{elevationrulename}_self",
                  "children": [
                    {
                      "choiceSettingCollectionValue": [
                        {
                          "settingValueTemplateReference": null,
                          "value": "device_vendor_msft_policy_privilegemanagement_elevationrules_{elevationrulename}_ruletype_validation_0",
                          "children": []
                        },
                        {
                          "settingValueTemplateReference": null,
                          "value": "device_vendor_msft_policy_privilegemanagement_elevationrules_{elevationrulename}_ruletype_validation_1",
                          "children": []
                        }
                      ],
                      "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingCollectionInstance",
                      "settingInstanceTemplateReference": null,
                      "settingDefinitionId": "device_vendor_msft_policy_privilegemanagement_elevationrules_{elevationrulename}_ruletype_validation"
                    }
                  ]
                },
                "settingInstanceTemplateReference": {
                  "settingInstanceTemplateId": "bc5a31ac-95b5-4ec6-be1f-50a384bb165f"
                },
                "settingDefinitionId": "device_vendor_msft_policy_privilegemanagement_elevationrules_{elevationrulename}_ruletype"
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "choiceSettingValue": {
                  "settingValueTemplateReference": null,
                  "value": "device_vendor_msft_policy_privilegemanagement_elevationrules_{elevationrulename}_allowrunelevatedrulerequired",
                  "children": []
                },
                "settingInstanceTemplateReference": null,
                "settingDefinitionId": "device_vendor_msft_policy_privilegemanagement_elevationrules_{elevationrulename}_childprocessbehavior"
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                "simpleSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                  "settingValueTemplateReference": {
                    "settingValueTemplateId": "a165327c-f0e5-4c7d-9af1-d856b02191f7",
                    "useTemplateDefault": false
                  },
                  "value": "thing.exe"
                },
                "settingInstanceTemplateReference": {
                  "settingInstanceTemplateId": "0c1ceb2b-bbd4-46d4-9ba5-9ee7abe1f094"
                },
                "settingDefinitionId": "device_vendor_msft_policy_privilegemanagement_elevationrules_{elevationrulename}_filename"
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                "simpleSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                  "settingValueTemplateReference": {
                    "settingValueTemplateId": "03f003e5-43ef-4e7e-bf30-57f00781fdcc",
                    "useTemplateDefault": false
                  },
                  "value": "test"
                },
                "settingInstanceTemplateReference": {
                  "settingInstanceTemplateId": "fdabfcf9-afa4-4dbf-a4ef-d5c1549065e1"
                },
                "settingDefinitionId": "device_vendor_msft_policy_privilegemanagement_elevationrules_{elevationrulename}_name"
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                "simpleSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                  "settingValueTemplateReference": {
                    "settingValueTemplateId": "f011bcfc-03cd-4b28-a1f4-305278d7a030",
                    "useTemplateDefault": false
                  },
                  "value": "c:\\some\\path"
                },
                "settingInstanceTemplateReference": {
                  "settingInstanceTemplateId": "c3b7fda4-db6a-421d-bf04-d485e9d0cfb1"
                },
                "settingDefinitionId": "device_vendor_msft_policy_privilegemanagement_elevationrules_{elevationrulename}_filepath"
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                "simpleSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                  "settingValueTemplateReference": {
                    "settingValueTemplateId": "e466f96d-0633-40b3-86a4-9e093b696077",
                    "useTemplateDefault": false
                  },
                  "value": "test"
                },
                "settingInstanceTemplateReference": {
                  "settingInstanceTemplateId": "234631a1-aeb1-436f-9e05-dcd9489caf08"
                },
                "settingDefinitionId": "device_vendor_msft_policy_privilegemanagement_elevationrules_{elevationrulename}_productname"
              }
            ]
          }
        ],
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "ee3d2e5f-6b3d-4cb1-af9b-37b02d3dbae2"
        },
        "settingDefinitionId": "device_vendor_msft_policy_privilegemanagement_elevationrules_{elevationrulename}"
      }
    }
  ],
  "assignments": {
    "value": [],
    "@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies('8621ac40-1ded-4c5b-8910-4f4dc9c1fae5')/assignments"
  }
}
