{
  "settingCount": 1,
  "@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity",
  "name": "test",
  "createdDateTime": "2024-11-12T10:04:59.8611355Z",
  "templateReference": {
    "templateDisplayVersion": null,
    "templateFamily": "none",
    "templateId": "",
    "templateDisplayName": null
  },
  "priorityMetaData": null,
  "roleScopeTagIds": [
    "0"
  ],
  "technologies": "mdm,appleRemoteManagement",
  "description": "",
  "id": "93612eeb-a307-403c-af5e-cdc36be0d27f",
  "platforms": "macOS",
  "lastModifiedDateTime": "2024-11-12T15:04:13.587351Z",
  "creationSource": null,
  "settingsDetails": [
    {
      "settingInstance": {
        "settingInstanceTemplateReference": null,
        "settingDefinitionId": "diskmanagement_diskmanagement",
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
        "groupSettingCollectionValue": [
          {
            "settingValueTemplateReference": null,
            "children": [
              {
                "settingInstanceTemplateReference": null,
                "settingDefinitionId": "diskmanagement_restrictions",
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
                "groupSettingCollectionValue": [
                  {
                    "settingValueTemplateReference": null,
                    "children": [
                      {
                        "settingInstanceTemplateReference": null,
                        "settingDefinitionId": "diskmanagement_restrictions_externalstorage",
                        "choiceSettingValue": {
                          "value": "diskmanagement_restrictions_externalstorage_0",
                          "children": [],
                          "settingValueTemplateReference": null
                        },
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
                      },
                      {
                        "settingInstanceTemplateReference": null,
                        "settingDefinitionId": "diskmanagement_restrictions_networkstorage",
                        "choiceSettingValue": {
                          "value": "diskmanagement_restrictions_networkstorage_1",
                          "children": [],
                          "settingValueTemplateReference": null
                        },
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
                      }
                    ]
                  }
                ]
              }
            ]
          }
        ]
      },
      "id": "0"
    }
  ]
}
