{
  "settingsDetails": [
    {
      "id": "0",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
        "settingInstanceTemplateReference": null,
        "groupSettingCollectionValue": [
          {
            "children": [
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
                "settingInstanceTemplateReference": null,
                "groupSettingCollectionValue": [
                  {
                    "children": [
                      {
                        "choiceSettingValue": {
                          "children": [],
                          "value": "diskmanagement_restrictions_externalstorage_0",
                          "settingValueTemplateReference": null
                        },
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                        "settingInstanceTemplateReference": null,
                        "settingDefinitionId": "diskmanagement_restrictions_externalstorage"
                      },
                      {
                        "choiceSettingValue": {
                          "children": [],
                          "value": "diskmanagement_restrictions_networkstorage_1",
                          "settingValueTemplateReference": null
                        },
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                        "settingInstanceTemplateReference": null,
                        "settingDefinitionId": "diskmanagement_restrictions_networkstorage"
                      }
                    ],
                    "settingValueTemplateReference": null
                  }
                ],
                "settingDefinitionId": "diskmanagement_restrictions"
              }
            ],
            "settingValueTemplateReference": null
          }
        ],
        "settingDefinitionId": "diskmanagement_diskmanagement"
      }
    }
  ]
}
