{
  "templateReference": {
    "templateDisplayName": null,
    "templateDisplayVersion": null,
    "templateId": "",
    "templateFamily": "none"
  },
  "lastModifiedDateTime": "2025-04-02T08:15:06.395953Z",
  "createdDateTime": "2025-04-02T08:15:06.395953Z",
  "technologies": "mdm,appleRemoteManagement",
  "platforms": "iOS",
  "id": "f7281c7e-b309-4809-8ce6-301cc7f4d9cf",
  "creationSource": null,
  "settingCount": 5,
  "name": "tet",
  "roleScopeTagIds": [
    "0"
  ],
  "@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity",
  "priorityMetaData": null,
  "description": "",
  "settings": [
    {
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
        "settingInstanceTemplateReference": null,
        "groupSettingCollectionValue": [
          {
            "children": [
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                "simpleSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                  "settingValueTemplateReference": null,
                  "value": "thing"
                },
                "settingInstanceTemplateReference": null,
                "settingDefinitionId": "com.apple.caldav.account_caldavaccountdescription"
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                "simpleSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                  "settingValueTemplateReference": null,
                  "value": "thing"
                },
                "settingInstanceTemplateReference": null,
                "settingDefinitionId": "com.apple.caldav.account_caldavhostname"
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                "simpleSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationSecretSettingValue",
                  "valueState": "encryptedValueToken",
                  "settingValueTemplateReference": null,
                  "value": "1714b863-343b-43a6-bce8-38d2c4afd13f"
                },
                "settingInstanceTemplateReference": null,
                "settingDefinitionId": "com.apple.caldav.account_caldavpassword"
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                "simpleSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                  "settingValueTemplateReference": null,
                  "value": 25
                },
                "settingInstanceTemplateReference": null,
                "settingDefinitionId": "com.apple.caldav.account_caldavport"
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                "simpleSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                  "settingValueTemplateReference": null,
                  "value": "thing"
                },
                "settingInstanceTemplateReference": null,
                "settingDefinitionId": "com.apple.caldav.account_caldavprincipalurl"
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingInstanceTemplateReference": null,
                "choiceSettingValue": {
                  "settingValueTemplateReference": null,
                  "value": "com.apple.caldav.account_caldavusessl_true",
                  "children": []
                },
                "settingDefinitionId": "com.apple.caldav.account_caldavusessl"
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                "simpleSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                  "settingValueTemplateReference": null,
                  "value": "{{USERNAME}}"
                },
                "settingInstanceTemplateReference": null,
                "settingDefinitionId": "com.apple.caldav.account_caldavusername"
              }
            ],
            "settingValueTemplateReference": null
          }
        ],
        "settingDefinitionId": "com.apple.caldav.account_com.apple.caldav.account"
      },
      "id": "0"
    },
    {
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
        "settingInstanceTemplateReference": null,
        "groupSettingCollectionValue": [
          {
            "children": [
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                "simpleSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                  "settingValueTemplateReference": null,
                  "value": "thing"
                },
                "settingInstanceTemplateReference": null,
                "settingDefinitionId": "com.apple.carddav.account_carddavaccountdescription"
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                "simpleSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                  "settingValueTemplateReference": null,
                  "value": "thing"
                },
                "settingInstanceTemplateReference": null,
                "settingDefinitionId": "com.apple.carddav.account_carddavhostname"
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                "simpleSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationSecretSettingValue",
                  "valueState": "encryptedValueToken",
                  "settingValueTemplateReference": null,
                  "value": "9a9fabfa-48ac-42f5-9580-20381560170f"
                },
                "settingInstanceTemplateReference": null,
                "settingDefinitionId": "com.apple.carddav.account_carddavpassword"
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                "simpleSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                  "settingValueTemplateReference": null,
                  "value": 1
                },
                "settingInstanceTemplateReference": null,
                "settingDefinitionId": "com.apple.carddav.account_carddavport"
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                "simpleSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                  "settingValueTemplateReference": null,
                  "value": "thing"
                },
                "settingInstanceTemplateReference": null,
                "settingDefinitionId": "com.apple.carddav.account_carddavprincipalurl"
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingInstanceTemplateReference": null,
                "choiceSettingValue": {
                  "settingValueTemplateReference": null,
                  "value": "com.apple.carddav.account_carddavusessl_true",
                  "children": []
                },
                "settingDefinitionId": "com.apple.carddav.account_carddavusessl"
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                "simpleSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                  "settingValueTemplateReference": null,
                  "value": "{{USERNAME}}"
                },
                "settingInstanceTemplateReference": null,
                "settingDefinitionId": "com.apple.carddav.account_carddavusername"
              }
            ],
            "settingValueTemplateReference": null
          }
        ],
        "settingDefinitionId": "com.apple.carddav.account_com.apple.carddav.account"
      },
      "id": "1"
    },
    {
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
        "settingInstanceTemplateReference": null,
        "groupSettingCollectionValue": [
          {
            "children": [
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                "simpleSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                  "settingValueTemplateReference": null,
                  "value": "thing"
                },
                "settingInstanceTemplateReference": null,
                "settingDefinitionId": "com.apple.ldap.account_ldapaccountdescription"
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                "simpleSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                  "settingValueTemplateReference": null,
                  "value": "thing"
                },
                "settingInstanceTemplateReference": null,
                "settingDefinitionId": "com.apple.ldap.account_ldapaccounthostname"
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                "simpleSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationSecretSettingValue",
                  "valueState": "encryptedValueToken",
                  "settingValueTemplateReference": null,
                  "value": "f438e515-e0c0-47b7-9f58-6bc240bbd38a"
                },
                "settingInstanceTemplateReference": null,
                "settingDefinitionId": "com.apple.ldap.account_ldapaccountpassword"
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingInstanceTemplateReference": null,
                "choiceSettingValue": {
                  "settingValueTemplateReference": null,
                  "value": "com.apple.ldap.account_ldapaccountusessl_true",
                  "children": []
                },
                "settingDefinitionId": "com.apple.ldap.account_ldapaccountusessl"
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                "simpleSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                  "settingValueTemplateReference": null,
                  "value": "{{USERNAME}}"
                },
                "settingInstanceTemplateReference": null,
                "settingDefinitionId": "com.apple.ldap.account_ldapaccountusername"
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
                "settingInstanceTemplateReference": null,
                "groupSettingCollectionValue": [
                  {
                    "children": [
                      {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                        "simpleSettingValue": {
                          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                          "settingValueTemplateReference": null,
                          "value": "thing"
                        },
                        "settingInstanceTemplateReference": null,
                        "settingDefinitionId": "com.apple.ldap.account_ldapsearchsettings_item_ldapsearchsettingdescription"
                      },
                      {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                        "settingInstanceTemplateReference": null,
                        "choiceSettingValue": {
                          "settingValueTemplateReference": null,
                          "value": "com.apple.ldap.account_ldapsearchsettings_item_ldapsearchsettingscope_2",
                          "children": []
                        },
                        "settingDefinitionId": "com.apple.ldap.account_ldapsearchsettings_item_ldapsearchsettingscope"
                      },
                      {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                        "simpleSettingValue": {
                          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                          "settingValueTemplateReference": null,
                          "value": "thing"
                        },
                        "settingInstanceTemplateReference": null,
                        "settingDefinitionId": "com.apple.ldap.account_ldapsearchsettings_item_ldapsearchsettingsearchbase"
                      }
                    ],
                    "settingValueTemplateReference": null
                  }
                ],
                "settingDefinitionId": "com.apple.ldap.account_ldapsearchsettings"
              }
            ],
            "settingValueTemplateReference": null
          }
        ],
        "settingDefinitionId": "com.apple.ldap.account_com.apple.ldap.account"
      },
      "id": "2"
    },
    {
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
        "settingInstanceTemplateReference": null,
        "groupSettingCollectionValue": [
          {
            "children": [
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                "simpleSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                  "settingValueTemplateReference": null,
                  "value": "thing"
                },
                "settingInstanceTemplateReference": null,
                "settingDefinitionId": "com.apple.subscribedcalendar.account_subcalaccountdescription"
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                "simpleSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                  "settingValueTemplateReference": null,
                  "value": "thing"
                },
                "settingInstanceTemplateReference": null,
                "settingDefinitionId": "com.apple.subscribedcalendar.account_subcalaccounthostname"
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                "simpleSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationSecretSettingValue",
                  "valueState": "encryptedValueToken",
                  "settingValueTemplateReference": null,
                  "value": "5449c303-04f0-4092-b732-d70e251fa8a3"
                },
                "settingInstanceTemplateReference": null,
                "settingDefinitionId": "com.apple.subscribedcalendar.account_subcalaccountpassword"
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingInstanceTemplateReference": null,
                "choiceSettingValue": {
                  "settingValueTemplateReference": null,
                  "value": "com.apple.subscribedcalendar.account_subcalaccountusessl_true",
                  "children": []
                },
                "settingDefinitionId": "com.apple.subscribedcalendar.account_subcalaccountusessl"
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                "simpleSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                  "settingValueTemplateReference": null,
                  "value": "{{USERNAME}}"
                },
                "settingInstanceTemplateReference": null,
                "settingDefinitionId": "com.apple.subscribedcalendar.account_subcalaccountusername"
              }
            ],
            "settingValueTemplateReference": null
          }
        ],
        "settingDefinitionId": "com.apple.subscribedcalendar.account_com.apple.subscribedcalendar.account"
      },
      "id": "3"
    },
    {
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
        "settingInstanceTemplateReference": null,
        "groupSettingCollectionValue": [
          {
            "children": [
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
                "settingInstanceTemplateReference": null,
                "groupSettingCollectionValue": [
                  {
                    "children": [
                      {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                        "simpleSettingValue": {
                          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                          "settingValueTemplateReference": null,
                          "value": "thing"
                        },
                        "settingInstanceTemplateReference": null,
                        "settingDefinitionId": "com.apple.airplay_allowlist_item_deviceid"
                      }
                    ],
                    "settingValueTemplateReference": null
                  }
                ],
                "settingDefinitionId": "com.apple.airplay_allowlist"
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
                "settingInstanceTemplateReference": null,
                "groupSettingCollectionValue": [
                  {
                    "children": [
                      {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                        "simpleSettingValue": {
                          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                          "settingValueTemplateReference": null,
                          "value": "thing"
                        },
                        "settingInstanceTemplateReference": null,
                        "settingDefinitionId": "com.apple.airplay_passwords_item_devicename"
                      },
                      {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                        "simpleSettingValue": {
                          "@odata.type": "#microsoft.graph.deviceManagementConfigurationSecretSettingValue",
                          "valueState": "encryptedValueToken",
                          "settingValueTemplateReference": null,
                          "value": "e85bbe41-3b16-4e74-b5ca-38b49890abfb"
                        },
                        "settingInstanceTemplateReference": null,
                        "settingDefinitionId": "com.apple.airplay_passwords_item_password"
                      }
                    ],
                    "settingValueTemplateReference": null
                  }
                ],
                "settingDefinitionId": "com.apple.airplay_passwords"
              }
            ],
            "settingValueTemplateReference": null
          }
        ],
        "settingDefinitionId": "com.apple.airplay_com.apple.airplay"
      },
      "id": "4"
    }
  ]
}
