{
  "name": "[Base] Prod | Windows - Settings Catalog | Microsoft Defender For Endpoint Telemetry ver1.0",
  "id": "e44a13ef-43dd-4292-9c8f-d6828910d22a",
  "creationSource": null,
  "roleScopeTagIds": [
    "0"
  ],
  "templateReference": {
    "templateDisplayName": "Endpoint detection and response",
    "templateDisplayVersion": "Version 1",
    "templateId": "0385b795-0f2f-44ac-8602-9f65bf6adede_1",
    "templateFamily": "endpointSecurityEndpointDetectionAndResponse"
  },
  "technologies": "mdm,microsoftSense",
  "settingCount": 3,
  "platforms": "windows10",
  "description": "Context: Device\n\nProfile still required so that device knows to send status to MDE. tried removing and telemetry stopped.\n\nApplied to all devices, both physical and virtual",
  "lastModifiedDateTime": "2022-06-04T07:15:45.0013354Z",
  "createdDateTime": "2022-06-04T07:12:46.91804Z",
  "@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity",
  "priorityMetaData": null,
  "settings": [
    {
      "id": "0",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "choiceSettingValue": {
          "children": [
            {
              "simpleSettingValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationSecretSettingValue",
                "valueState": "encryptedValueToken",
                "value": "6cf9d831-327d-4dce-9ff8-f18d45902623",
                "settingValueTemplateReference": null
              },
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
              "settingInstanceTemplateReference": null,
              "settingDefinitionId": "device_vendor_msft_windowsadvancedthreatprotection_onboarding_fromconnector"
            }
          ],
          "value": "device_vendor_msft_windowsadvancedthreatprotection_configurationtype_autofromconnector",
          "settingValueTemplateReference": {
            "settingValueTemplateId": "e5c7c98c-c854-4140-836e-bd22db59d651",
            "useTemplateDefault": false
          }
        },
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "23ab0ea3-1b12-429a-8ed0-7390cf699160"
        },
        "settingDefinitionId": "device_vendor_msft_windowsadvancedthreatprotection_configurationtype"
      }
    },
    {
      "id": "1",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "choiceSettingValue": {
          "children": [],
          "value": "device_vendor_msft_windowsadvancedthreatprotection_configuration_samplesharing_1",
          "settingValueTemplateReference": {
            "settingValueTemplateId": "f72c326c-7c5b-4224-b890-0b9b54522bd9",
            "useTemplateDefault": false
          }
        },
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "6998c81e-2814-4f5e-b492-a6159128a97b"
        },
        "settingDefinitionId": "device_vendor_msft_windowsadvancedthreatprotection_configuration_samplesharing"
      }
    },
    {
      "id": "2",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "choiceSettingValue": {
          "children": [],
          "value": "device_vendor_msft_windowsadvancedthreatprotection_configuration_telemetryreportingfrequency_2",
          "settingValueTemplateReference": {
            "settingValueTemplateId": "350b0bea-b67b-43d4-9a04-c796edb961fd",
            "useTemplateDefault": false
          }
        },
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "03de6095-07c4-4f35-be38-c1cd3bae4484"
        },
        "settingDefinitionId": "device_vendor_msft_windowsadvancedthreatprotection_configuration_telemetryreportingfrequency"
      }
    }
  ],
  "assignments": {
    "id": "e44a13ef-43dd-4292-9c8f-d6828910d22a_adadadad-808e-44e2-905a-0b7873a8a531",
    "target": {
      "@odata.type": "#microsoft.graph.allDevicesAssignmentTarget",
      "deviceAndAppManagementAssignmentFilterId": null,
      "deviceAndAppManagementAssignmentFilterType": "none"
    },
    "source": "direct",
    "sourceId": "e44a13ef-43dd-4292-9c8f-d6828910d22a"
  }
}
