{
  "@odata.type": "#microsoft.graph.macOSPkgApp",
  "id": "String (identifier)",
  "displayName": "String",
  "description": "String",
  "publisher": "String",
  "largeIcon": {
    "@odata.type": "microsoft.graph.mimeContent",
    "type": "String",
    "value": "binary"
  },
  "createdDateTime": "String (timestamp)",
  "lastModifiedDateTime": "String (timestamp)",
  "isFeatured": true,
  "privacyInformationUrl": "String",
  "informationUrl": "String",
  "owner": "String",
  "developer": "String",
  "notes": "String",
  "uploadState": 1024,
  "publishingState": "String",
  "isAssigned": true,
  "roleScopeTagIds": [
    "String"
  ],
  "dependentAppCount": 1024,
  "supersedingAppCount": 1024,
  "supersededAppCount": 1024,
  "committedContentVersion": "String",
  "fileName": "String",
  "size": 1024,
  "primaryBundleId": "String",
  "primaryBundleVersion": "String",
  "includedApps": [
    {
      "@odata.type": "microsoft.graph.macOSIncludedApp",
      "bundleId": "String",
      "bundleVersion": "String"
    }
  ],
  "ignoreVersionDetection": true,
  "minimumSupportedOperatingSystem": {
    "@odata.type": "microsoft.graph.macOSMinimumOperatingSystem",
    "v10_7": true,
    "v10_8": true,
    "v10_9": true,
    "v10_10": true,
    "v10_11": true,
    "v10_12": true,
    "v10_13": true,
    "v10_14": true,
    "v10_15": true,
    "v11_0": true,
    "v12_0": true,
    "v13_0": true,
    "v14_0": true
  },
  "preInstallScript": {
    "@odata.type": "microsoft.graph.macOSAppScript",
    "scriptContent": "String"
  },
  "postInstallScript": {
    "@odata.type": "microsoft.graph.macOSAppScript",
    "scriptContent": "String"
  }
}